Revit 2027 API
BuiltInFailures.EditingFailures.CannotDrawInCurrentView Property
 Can't draw because Work Plane is at a very sharp angle in this view. Go to another view or redefine the Work Plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawInCurrentView { get; }
Public Shared ReadOnly Property CannotDrawInCurrentView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawInCurrentView {
	FailureDefinitionId^ get ();
}
static member CannotDrawInCurrentView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace